sleemanj/ESP8266_Simple/ESP8266_Simple.cpp
/** 
 * Copyright (C) 2014 James Sleeman
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a 
 * copy of this software and associated documentation files (the "Software"), 
 * to deal in the Software without restriction, including without limitation 
 * the rights to use, copy, modify, merge, publish, distribute, sublicense, 
 * and/or sell copies of the Software, and to permit persons to whom the 
 * Software is furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in 
 * all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE 
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER 
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, 
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN 
 * THE SOFTWARE.
 * 
 * @author James Sleeman, http://sparks.gogo.co.nz/
 * @license MIT License
 */

#include <Arduino.h>
#include <SoftwareSerial.h>
// PLEASE NOTE!
// The Arduino IDE is a bit braindead, even though we include SoftwareSerial.h here, it does nothing
// you must include SoftwareSerial.h in your main sketch, the Arduino IDE will not include Wire
// in the build process otherwise.

#include "ESP8266_Simple.h"
#include "ESP8266_Serial.h"

#if ESP8266_SERIALMODE == ESP8266_SOFTWARESERIAL
ESP8266_Simple::ESP8266_Simple(short rxPin, short txPin)
{
  // this->espSerial = new SoftwareSerial(rxPin,txPin);
  this->espSerial = new ESP8266_Serial(rxPin,txPin);
  this->generalCommandTimeoutMicroseconds = 2000000;
}
#endif

#if ESP8266_SERIALMODE == ESP8266_HARDWARESERIAL
ESP8266_Simple::ESP8266_Simple()
{
  this->espSerial = &Serial;
  this->generalCommandTimeoutMicroseconds = 2000000;
}
#endif

/** Connect to ESP8266 Device */
byte ESP8266_Simple::begin(long baudRate)
{  
  this->espSerial->begin(baudRate);  
  return ESP8266_OK;
}

byte ESP8266_Simple::setupAsWifiStation(const char *SSID, const char *Password, Print *debugPrinter)
{
  if(!strlen(SSID) || !strlen(Password))
  {
    if(debugPrinter)
    {
      debugPrinter->println(F("Missing SSID/Password, see sketch #defines."));
      while(1);
    }
  }
    
  byte responseCode;
  
  // Reset the ESP8266 Device (soft reset)
  do
  { // Keep trying to reset until it works
    if(debugPrinter)
    {
      debugPrinter->print(F("Reset: "));
    }
    
    responseCode = this->reset();
    if(responseCode == ESP8266_OK)
    {
      if(debugPrinter)
      {
        debugPrinter->println("OK");
      }
    }
    else
    {
      if(debugPrinter)
      {
        this->debugPrintError(responseCode, debugPrinter);      
      }
      delay(1000);
    }
  } while(responseCode != ESP8266_OK);
  
  
  
  // Connect To The Wifi Network
  do
  { // Keep trying to connect  until it works
    if(debugPrinter)
    {
      debugPrinter->print(F("Connect: "));
    }
    responseCode = this->connectToWifi(SSID,Password);
    if(responseCode == ESP8266_OK)
    {
      if(debugPrinter)
      {
        debugPrinter->println(F("OK"));
      }              
    }
    else
    {
      if(debugPrinter)
      {
        this->debugPrintError(responseCode, debugPrinter);      
      }
      delay(1000);
    }
  } while(responseCode != ESP8266_OK);
  
  // Print Our IP Address
  char ipAddressString[16];
  do
  { // Keep trying to connect  until it works
    if(debugPrinter)
    {
      debugPrinter->print(F("IP Address: "));      
    }
    responseCode = this->getIPAddress(ipAddressString);
    if(responseCode == ESP8266_OK)
    {
      if(debugPrinter)
      {
        debugPrinter->println(ipAddressString);                
      }      
    }
    else
    {
      if(debugPrinter)
      {
        this->debugPrintError(responseCode, debugPrinter);      
      }      
      delay(1000);
    }
  } while(responseCode != ESP8266_OK);

  
  
}

unsigned int ESP8266_Simple::GET(const __FlashStringHelper *serverIp, int port, char *requestPathAndResponseBuffer, int bufferLength, const __FlashStringHelper *httpHost, int bodyResponseOnlyFromLine)
{
  if(!serverIp)                       return ESP8266_ERROR;
  char serverIpBuffer[strlen_P((const char *)serverIp)+1];
  strcpy_P(serverIpBuffer, (const char *) serverIp); 
  
  unsigned long serverIpLong;
  this->ipConvertDatatypeFromTo(serverIpBuffer, serverIpLong);
  return this->GET(serverIpLong, port, requestPathAndResponseBuffer, bufferLength, httpHost, bodyResponseOnlyFromLine);
}

unsigned int ESP8266_Simple::GET(unsigned long serverIp, int port, char *requestPathAndResponseBuffer, int bufferLength, const __FlashStringHelper *httpHost, int bodyResponseOnlyFromLine)
{
  if(!serverIp)                       return ESP8266_ERROR;
  if(!requestPathAndResponseBuffer)   return ESP8266_ERROR;
  
  char serverIpBuffer[strlen_P((const char *)serverIp)+1];
  strcpy_P(serverIpBuffer, (const char *) serverIp); 
  
  int  httpResponseCode = 0;
  byte responseCode;
  
  if(httpHost && strlen_P((const char *)httpHost))
  {
    char httpHostBuffer[strlen_P((const char *)httpHost)+1];
    strcpy_P(httpHostBuffer, (const char *)httpHost);
    responseCode = this->sendHttpRequest(serverIp, port, requestPathAndResponseBuffer, bufferLength, httpHostBuffer, bodyResponseOnlyFromLine, &httpResponseCode); 
  } 
  else
  {
    responseCode = this->sendHttpRequest(serverIp, port, requestPathAndResponseBuffer, bufferLength, NULL, bodyResponseOnlyFromLine, &httpResponseCode);     
  }
  
  if(responseCode != ESP8266_OK)
  {
    return responseCode;
  }
  
  return httpResponseCode;
}

/** Reset the device (soft reset) */
byte ESP8266_Simple::reset()
{   
  byte remainingAttempts = 5;
  
  while ( this->sendCommand(F("AT+RST")) != ESP8266_OK )
  {
    if(--remainingAttempts == 0) return ESP8266_ERROR;
    delay(1000);    
  }
  remainingAttempts = 5;
  
