sleemanj/ESP8266_Simple/ESP8266_Simple.cpp
  // delay(4000);
  // Once the reset is issued OK, try to issue an AT command
  // and wait until that works
  while ( this->sendCommand("AT") != ESP8266_OK )
  {
    if(--remainingAttempts == 0) return ESP8266_ERROR;
    delay(1000);    
  }
  
  ESP82336_DEBUGLN("RESET OK");
  
  return ESP8266_OK;  
}

byte ESP8266_Simple::getFirmwareVersion(long &versionResponse)
{
  char buffer[11];
  byte responseCode = this->sendCommand(F("AT+GMR"), buffer, 11);
  if(responseCode == ESP8266_OK)
  {
    buffer[10] = 0; // Ensure string is terminated after 10 characters
    versionResponse = atol(buffer);    
  }
  return responseCode;
}

byte ESP8266_Simple::setWifiMode(byte mode)
{
  char modeBuff[12];
  strcpy_P(modeBuff, PSTR("AT+CWMODE="));
  itoa((int)mode,modeBuff+10,10);
  return this->sendCommand(modeBuff);
}

byte ESP8266_Simple::getAccessPointsList(char *buffer, int bufferSize )
{
  return this->sendCommand(F("AT+CWLAP"), buffer, bufferSize);  
}

byte ESP8266_Simple::getIPAddress(unsigned long &ipAddress)
{
  char buffer[16]; // [3].[3].[3].[3][NUL]
  byte errCode;
  
  errCode     = this->sendCommand(F("AT+CIFSR"), buffer, sizeof(buffer));
  if(errCode) return errCode;
  
  this->ipConvertDatatypeFromTo(buffer, ipAddress);
  
  return ESP8266_OK;
}

byte ESP8266_Simple::getIPAddress(char * ipAddress)
{    
  unsigned long ipAddressLong;
  byte errCode;
  errCode = this->getIPAddress(ipAddressLong);
  if(errCode) return errCode;
  
  this->ipConvertDatatypeFromTo(ipAddressLong, ipAddress);    
  return ESP8266_OK;
}

byte ESP8266_Simple::setTimeout(int seconds)
{
  this->generalCommandTimeoutMicroseconds = seconds * 1000 * 1000;
  
  return ESP8266_OK;
}

long ESP8266_Simple::connectToWifi(const char *SSID, const char *Password)
{
  byte returnValue;
  unsigned long previousTimeout = this->generalCommandTimeoutMicroseconds;
  
  // First set to client mode
  returnValue = this->setWifiMode(ESP8266_STATION);
  if(returnValue != ESP8266_OK) return returnValue;
  
  // Not sure if a QAP is a good idea here?
  /*
    returnValue = this->disconnectFromWifi();
    if(returnValue != ESP8266_OK) return returnValue;
  */
  
  
  char atCmd[11];
  strcpy_P(atCmd, PSTR("AT+CWJAP=\"")); // PSTR monkeying to save a few bytes
  const char *cmdParts[] = {
    atCmd,
    SSID,
    "\",\"",
    Password,
    "\""
  };
  
  // Connecting to Wifi takes a while
  this->generalCommandTimeoutMicroseconds = max((long)5*1000*1000, this->generalCommandTimeoutMicroseconds);

  returnValue = this->sendCommand((const char **)cmdParts,(byte)5, (char *)NULL,(int)0, (byte)1);
  this->generalCommandTimeoutMicroseconds = previousTimeout;
  return returnValue;
}

byte ESP8266_Simple::disconnectFromWifi()
{
  return this->sendCommand(F("AT+CWQAP"));  
}

byte ESP8266_Simple::startHttpServer(unsigned port, ESP8266_HttpServerHandler *httpServerHandlersArg, unsigned int numOfHandlers, unsigned int maxBufferSize, Print *debugPrinter) 
{
  byte responseCode;
  
  this->httpServerHandlers = httpServerHandlersArg;
  this->httpServerHandlersLength = numOfHandlers;
    
  do
  {
    if(debugPrinter)
    {
        debugPrinter->print(F("Starting HTTP Server: "));
    }
    
    if((responseCode = this->startHttpServer(port, (long unsigned int (*)(char*, int))NULL, maxBufferSize) != ESP8266_OK))
    {
      if(debugPrinter)
      {
        this->debugPrintError(responseCode, debugPrinter);
      }           
    }
    else
    {        
      if(debugPrinter)
      {
        debugPrinter->println(F("OK"));
      }
      break;
    }
  }
  while(1);
  
  
  return ESP8266_OK;
}


byte ESP8266_Simple::startHttpServer(unsigned port, unsigned long (* requestHandler)(char *buffer, int bufferLength), unsigned int maxBufferSize)
{
  char cmdBuffer[64];
  byte responseCode;
  
  this->httpServerRequestHandler = requestHandler;
  this->httpServerMaxBufferSize = maxBufferSize;
  
  // Enter MUX mode
  responseCode = this->sendCommand(F("AT+CIPMUX=1"));
  if(responseCode != ESP8266_OK) return responseCode;
  
  // Set Server Timeout
  memset(cmdBuffer,0,sizeof(cmdBuffer));
  strcpy_P(cmdBuffer, PSTR("AT+CIPSTO=,"));
  ultoa(this->generalCommandTimeoutMicroseconds/1000/1000, cmdBuffer+strlen(cmdBuffer), 10);    
  this->sendCommand(cmdBuffer);
  
  // Start Server
  memset(cmdBuffer,0,sizeof(cmdBuffer));
  strcpy_P(cmdBuffer, PSTR("AT+CIPSERVER=1,"));
  itoa(port, cmdBuffer+strlen(cmdBuffer), 10);    
  responseCode = this->sendCommand(cmdBuffer);
  if(responseCode != ESP8266_OK) return responseCode;
    
  return ESP8266_OK;
}

byte ESP8266_Simple::stopHttpServer()
{
  return ESP8266_ERROR;
}

byte ESP8266_Simple::serveHttpRequest()
{
  if(!this->espSerial->available()) return ESP8266_OK; // Nothing to do

  char cmdBuffer[64];
  char hdrBuffer[45];     
  
  char dataBuffer[this->httpServerMaxBufferSize];
  int  requestLength;
  byte responseCode;
  unsigned long  httpStatusCodeAndType;
  int  muxChannel = -1; // This will be set by readIPD(), we need to start with -1
                        // to indicate we will accept any channel, we will get
                        // packet data for whatever channel is first off the block
                        // any inter-mingled packet data from other channels is discarded
                        // for best results, only issue one request at a time!
  
  memset(dataBuffer,0,sizeof(dataBuffer));
  
  if((requestLength = this->readIPD(dataBuffer,sizeof(dataBuffer),-1,NULL,&muxChannel)))
  {
    // Call the handler, note we reserve the last byte of the data buffer
    // it will always be null for safety
    if(this->httpServerRequestHandler)
    {
      httpStatusCodeAndType = (*(this->httpServerRequestHandler))(dataBuffer,sizeof(dataBuffer)-1);
    }
    else
    {      
      httpStatusCodeAndType = this->httpServerRequestHandler_Builtin(dataBuffer, sizeof(dataBuffer)-1);
    }
    
    // Ensure that the last byte of the buffer is null for safety
    dataBuffer[sizeof(dataBuffer)-1] = 0;
    
    // Clear header and command buffer
    memset(hdrBuffer, 0, sizeof(hdrBuffer));
    memset(cmdBuffer,0,sizeof(cmdBuffer));
    
    // If it's not a raw response, make some headers
    if(!(httpStatusCodeAndType & ESP8266_RAW))
    {
      strncpy_P(hdrBuffer, PSTR("HTTP/1.0 "), sizeof(hdrBuffer)-1);
      itoa( httpStatusCodeAndType & 0x00FFFFFF,hdrBuffer+strlen(hdrBuffer), 10);
      strncpy_P(hdrBuffer+strlen(hdrBuffer), PSTR("\r\nContent-type: "), sizeof(hdrBuffer)-strlen(hdrBuffer)-1);
      
