sleemanj/ESP8266_Simple/ESP8266_Simple.cpp
  if(httpHost)
  {
    int httpResponseCodeBuffer;
    this->readIPD(requestPathAndResponseBuffer,bufferLength,bodyResponseOnlyFromLine, &httpResponseCodeBuffer);
    
    if(httpResponseCode)
    {
      *httpResponseCode = httpResponseCodeBuffer;
    }
  }
  else
  {
    this->readIPD(requestPathAndResponseBuffer,bufferLength,bodyResponseOnlyFromLine);
  }
  
  if(this->unlinkConnection() != ESP8266_OK)
  {
    this->reset();
  }
  this->sendCommand(F("AT+CIPSTATUS"));
  return ESP8266_OK;    
}

unsigned int ESP8266_Simple::readIPD(char *responseBuffer, int responseBufferLength, int bodyResponseOnlyFromLine, int *parseHttpResponse, int *muxChannel)
{  
  if(!this->espSerial->waitUntilAvailable()) return 0;
  
 // Serial.print("BRFL: ");
 // Serial.println(bodyResponseOnlyFromLine);
  
  unsigned long startTime         = millis();
  unsigned long firstPacketWait   = this->generalCommandTimeoutMicroseconds*1000; // If we don't get a packet in this time, abort
  
  char cmdBuffer[128];
  
  memset(cmdBuffer,0,sizeof(cmdBuffer));
  memset(responseBuffer,0,responseBufferLength);
  
  int cmdBufferIndex          = 0;
  int responseBufferIndex     = 0;    
  int packetLength            = -1;
  int bytesRead               = 0;
  int lineNumber              = -1;
  int packetCount             = 0;
  
  // For HTTP parsing only
  byte headerEnd              = 0;
 
  do
  {
    if(!this->espSerial->waitUntilAvailable()) continue;
    
    if(packetLength == -1)
    { // Look for the +IPD response from the ESP8266 to get the number of bytes to read
      // note that we might also pick up an "OK" and other sillyness from the trailing of 
      // a previous +IPD segment (each +IPD is a packet's contents, maximum MTU of your network 
      // limits it (less a bit for TCP/IP overheads)).
      if((bytesRead = this->espSerial->readBytesUntilAndIncluding(':', cmdBuffer, sizeof(cmdBuffer), 1)) > 4)
      {
        // This is probably a bit brittle, but we don't want to waste time 
        // while the serial buffer is filling.  Ideally we would check that
        // there is a series of digits before the : and the characters "+IPD," before those        
        if(cmdBuffer[bytesRead-1] == ':')
        {
          // There might be whitespace at the start of this line, we are looking at 
          //  +IPD[,mux#],1234
          //  where 1234 is the number of bytes to follow, 
          //  so we will walk backwards to find the , and then from that point forward
          //  convert to an integer
          for(cmdBufferIndex = bytesRead-1; cmdBufferIndex >= 0; cmdBufferIndex--)
          {
            if(cmdBuffer[cmdBufferIndex-1] == ',') break;
          }
          packetLength = atoi(cmdBuffer+cmdBufferIndex);   
          packetCount++;
        
          // We also might want to find a mux channel
          for(cmdBufferIndex = cmdBufferIndex-2; cmdBufferIndex >= 0; cmdBufferIndex--)
          {
            if(cmdBuffer[cmdBufferIndex-1] == ',') break;
          }                    
          if(cmdBufferIndex)
          {
            // If we get a mux channel, compare it to the request one, if it 
            // isn't a match, skip this packet (but we keep the packetCount)
            if(muxChannel && (*muxChannel < 0)) *muxChannel = atoi(cmdBuffer+cmdBufferIndex);
            else if(muxChannel && (*muxChannel != atoi(cmdBuffer+cmdBufferIndex)))
            {
              // ignore this packet, it's not for us
              this->clearSerialBuffer();
              packetLength = -1;
            }
          }
          
          ESP82336_DEBUG("Packet Length: ");
          ESP82336_DEBUGLN(packetLength);
        }
        else if(cmdBuffer[0] == 'O') // "OK" - signals end of packet data
        {
          
        }
        else if(cmdBuffer[0] == 'U' && cmdBuffer[5] == 'k') // "Unlink" - signals end of stream
        {
          break;
        }
      }
      
      memset(cmdBuffer,0,sizeof(cmdBuffer));
      cmdBufferIndex = 0;
      continue;      
    }
    else
    { 
      startTime = millis(); // Reset the start time every time we read in (part of) a packet
      
      // If packet is empty, or responseBuffer is full, just 
      // finish up now and discard everything
      if(min(packetLength,responseBufferLength-responseBufferIndex-1) <= 0)
      {
        break;
      }
      
      if(this->espSerial->overflow())
      {
        ESP82336_DEBUGLN("OVERFLOW");
      }
      
      // Read up to the next newline, or all the remaining response, or as much as we can fit in the buffer, whichever comes first      
      bytesRead = this->espSerial->readBytesUntilAndIncluding('\n', responseBuffer+responseBufferIndex, min(packetLength,responseBufferLength-responseBufferIndex-1));
      
      // If we read 1 byte, the index for the next write goes up one (effectivly responseBufferIndex is always the trailing null position
      //  or if you prefer, the number of bytes stored in the buffer)
      responseBufferIndex    += bytesRead;
      
      // Reduce the remaining response by the # of bytes read
      packetLength -= bytesRead;
      
      
      // The first time round, lineNumber will still be zero
      if(lineNumber == -1)
      {
        // First line of first packet should be status code (hopefully nobody out there has preceeding whitespace)
        if(parseHttpResponse)
        {
          if(strcmp_P(responseBuffer, PSTR("HTTP/")) == 0)
          {
            *parseHttpResponse = atoi(responseBuffer+9); // 9 == strlen("HTTP/1.1 ")
          }
          else
          {
            *parseHttpResponse = 0; // Unknown
          }
        }
        
        // And now we will rename line 0 to be line 1
        lineNumber = 1;
      }
      
      // if we are parsing HttpResponse, we are getting headers, see if 
      // we should skip them
      
      // If bodyResponseOnlyFromLine is 1 or more and we have headers, we need to skip the headers        
      if(parseHttpResponse && bodyResponseOnlyFromLine > 0 && !headerEnd )
      {
        // Because we are discarding lines up to the trailing \r\n, we can
        // just test from the start of the buffer
        if(responseBufferIndex > 1 && responseBuffer[0] == '\n' && (responseBuffer[2] == '\n' || responseBuffer[1] == '\n'))
        {
          // \r\n\r\n is found          
          headerEnd = true;
          memset(responseBuffer,0,responseBufferLength);
          responseBufferIndex = 0;  
          lineNumber = 1;
        }
        else
        {   
          //ESP82336_DEBUGLN(responseBuffer);
          /*
          ESP82336_DEBUG("0=")
          ESP82336_DEBUG((byte)responseBuffer[0]);
          ESP82336_DEBUG("; 1=")
          ESP82336_DEBUG((byte)responseBuffer[1]);
          ESP82336_DEBUG("; 2=")
          ESP82336_DEBUG((byte)responseBuffer[2]);
          ESP82336_DEBUG("; X=")
          ESP82336_DEBUGLN((byte)responseBuffer[responseBufferIndex-1]);
          */
          
