sleemanj/ESP8266_Simple/ESP8266_Simple.cpp
          responseBuffer[0] = responseBuffer[responseBufferIndex-1];  
          
          //ESP82336_DEBUG("L=")
          //ESP82336_DEBUGLN((byte)responseBuffer[responseBufferIndex-1]);
          
          memset(responseBuffer+1,0,responseBufferIndex);            
          responseBufferIndex = 1;       
          
          // Increment the line number for the next round if we finished on a newline
          //  otherwise the next round is a continuation of this line
          if(responseBuffer[responseBufferIndex-1] == '\n')
          {
            lineNumber++;
          }
        }
        
      }
      
      // A "negative" bodyResponseOnlyFromLine means skip this many headers and then include the rest 
      // provided that headers are avalable (which will be the case only if httpHost is defined)      
      // if we have not reached the minimum line yet, empty the buffer
      else if( abs(bodyResponseOnlyFromLine) > lineNumber)
      {
        /*
        Serial.print("SKIP ");
        Serial.print(lineNumber);
        Serial.print(" :");
        Serial.println(responseBuffer);
        */
        
         // Increment the line number for the next round if we finished on a newline
        //  otherwise the next round is a continuation of this line
        if(responseBuffer[responseBufferIndex-1] == '\n')
        {
          lineNumber++;
        }
        
        memset(responseBuffer,0,responseBufferLength);
        responseBufferIndex = 0;        
      }
      else if(bodyResponseOnlyFromLine < 0)
      { 
        // A negative response means get ONLY headers (from the abs line)
        if( responseBuffer[responseBufferIndex-1] == '\n'
         && ( 
             (strlen(responseBuffer) >= 2 && responseBuffer[responseBufferIndex-2] == '\n') // \n\n[NULL]
          || (strlen(responseBuffer) >= 4 && responseBuffer[responseBufferIndex-3] == '\n') // \r\n\r\n[NULL]
         )
        )
        {
          // done
          break;
        }        
      }
     
      
      // If there is room in the buffer and more to be got, try to get more
      if(packetLength > 0 && responseBufferIndex < (responseBufferLength - 1))
      {   
        this->espSerial->waitUntilAvailable();
        continue;
      }
      else if(packetLength <= 0 && responseBufferIndex < (responseBufferLength - 1))
      {
        // Try for the next packet
        packetLength = -1;
        continue;
      }
      
      break;
    }    
  }
  while(millis() - startTime < (packetCount ? firstPacketWait : (this->generalCommandTimeoutMicroseconds*1000))); //  Timeout to go here
  
  
  return responseBufferIndex;
}

byte ESP8266_Simple::unlinkConnection()
{
  char cmdBuffer[8];
  memset(cmdBuffer, 0, sizeof(cmdBuffer));
  ESP82336_DEBUGLN();
  ESP82336_DEBUGLN("UNLINKING");
  // Blindly send a CIPCLOSE to try and kill the connection now
  // NOTE: Nope, this tends to cause the ESP to crash out
  // this->espSerial->println(F("AT+CIPCLOSE"));

  // Dump everything else until we see "Unlink" or nothing else seems to be available
  do
  {    
    if(this->espSerial->waitUntilAvailable() == 0 || !this->espSerial->readBytesUntilAndIncluding('\n', cmdBuffer, sizeof(cmdBuffer)-1))
    {   
      return ESP8266_TIMEOUT;      // Caller might want to do a reset()
    }
    ESP82336_DEBUG(cmdBuffer);
  } while( // We really need to keep up and not have any overflow, so not using string comparison here
    cmdBuffer[0] != 'U' || 
    cmdBuffer[1] != 'n' || 
    cmdBuffer[2] != 'l' || 
    cmdBuffer[3] != 'i' || 
    cmdBuffer[4] != 'n' || 
    cmdBuffer[5] != 'k'
  );
  
  if(strncmp_P(cmdBuffer, PSTR("Unlink"), 6) == 0)
  {    
    return ESP8266_OK;
  }
  else
  {
    return ESP8266_ERROR;
  }
}

void ESP8266_Simple::ipConvertDatatypeFromTo(const char *ipAddressString, unsigned long &ipAddressLong)
{  
  byte i;
  
  ipAddressLong = (unsigned long) atoi(ipAddressString);
  
  for(i = 0; i < 15; i++)
  {
    if(ipAddressString[i] == '.')
    {
      
      ipAddressLong = (ipAddressLong << 8) | (unsigned long) atoi(ipAddressString+i+1);
      break;
    }
  }
  
  for(i++; i < 15; i++)
  {
    if(ipAddressString[i] == '.')
    {      
      ipAddressLong = (ipAddressLong << 8) | (unsigned long) atoi(ipAddressString+i+1);
      break;
    }
  }
  
  for(i++; i < 15; i++)
  {
    if(ipAddressString[i] == '.')
    {
      ipAddressLong = (ipAddressLong << 8) | (unsigned long) atoi(ipAddressString+i+1);
      break;
    }
  }    
}

void ESP8266_Simple::ipConvertDatatypeFromTo(unsigned long ipAddressLong, char *ipAddressStringBuffer)
{
  char quadBuff[4];
  
  memset(ipAddressStringBuffer, 0, 16); // Clear buffer
  
  // First byte
  ultoa(((ipAddressLong >> 24) & 0xFF), quadBuff, 10);
  strncpy(ipAddressStringBuffer,quadBuff, 3);
  ipAddressStringBuffer[strlen(ipAddressStringBuffer)] = '.';
  
  // Second byte
  ultoa(((ipAddressLong >> 16) & 0xFF), quadBuff, 10);
  strncpy(ipAddressStringBuffer+strlen(ipAddressStringBuffer),quadBuff, 3);
  ipAddressStringBuffer[strlen(ipAddressStringBuffer)] = '.';
  
  // Third byte
  ultoa(((ipAddressLong >> 8) & 0xFF), quadBuff, 10);
  strncpy(ipAddressStringBuffer+strlen(ipAddressStringBuffer),quadBuff, 3);
  ipAddressStringBuffer[strlen(ipAddressStringBuffer)] = '.';
  
  // Final byte
  ultoa(((ipAddressLong >> 0) & 0xFF), quadBuff, 10);
  strncpy(ipAddressStringBuffer+strlen(ipAddressStringBuffer),quadBuff, 3);
}

byte ESP8266_Simple::sendCommand(const char *cmd, char *responseBuffer, int responseBufferLength, byte getResponseFromLine)
{
  return this->sendCommand(&cmd, 1, responseBuffer, responseBufferLength, getResponseFromLine);
}

byte ESP8266_Simple::sendCommand(const __FlashStringHelper *cmd, char *responseBuffer, int responseBufferLength, byte getResponseFromLine)
{
  char cmdBuffer[strlen_P((const char *)cmd)+1];
  strcpy_P(cmdBuffer, (const char *) cmd); 
  
  // WHY DOES THIS NOT WORK??
  // return this->sendCommand((const char **)&cmdBuffer, 1, responseBuffer, responseBufferLength, getResponseFromLine);
  
