sleemanj/ESP8266_Simple/ESP8266_Simple.cpp
  return this->sendCommand((const char *)cmdBuffer, responseBuffer, responseBufferLength, getResponseFromLine);
}

// Send command and get response into a buffer
byte ESP8266_Simple::sendCommand(const char **cmdPartsToConcatenate, byte numParts, char *responseBuffer, int responseBufferLength, byte getResponseFromLine)
{
  char statusBuffer[64];
  unsigned long waitingMicroSeconds = 0;
  int  responseBufferIndex = 0;
  byte statusBufferIndex   = 0;
  byte responseLineNum     = 0;
  int bytesRead            = 0;
  
  // Clear response buffer
  if(responseBufferLength)
  {
    memset(responseBuffer,0,responseBufferLength);
  }
  
  // Clear status buffer
  memset(statusBuffer,0,sizeof(statusBuffer));
    
  this->clearSerialBuffer();

  // this->espSerial->print("AT+");
  // this->espSerial->println(cmd);
  ESP82336_DEBUGLN()
  ESP82336_DEBUG("SEND {{{");
  for(bytesRead = 0; bytesRead < numParts; bytesRead++)
  {
    ESP82336_DEBUG(cmdPartsToConcatenate[bytesRead]);
    this->espSerial->print((const char *)cmdPartsToConcatenate[bytesRead]);
    this->clearSerialBuffer(); // The character echo will fill up the buffer and overflow, we just clear them out.
                               // the last println() we keave so that we don't accidentally clear any response.
  }  
  this->espSerial->println();
  ESP82336_DEBUGLN("}}}");
  bytesRead = 0;
    
  do
  {
    #if ESP8266_SERIALMODE == ESP8266_SOFTWARESERIAL
      // There is no overflow() in the HardwareSerial code, guess we'll just
      // hope it never happens
      if(this->espSerial->overflow())
      {
        ESP82336_DEBUGLN("Overflow in HERE");
        this->clearSerialBuffer();
        return ESP8266_OVERFLOW;   
      }
    #endif
    
    if(this->espSerial->available())
    {
      memset(statusBuffer,0,sizeof(statusBuffer));
      if(!responseLineNum)
      {
        // read bytes up until the first \n and discard them, this is just the echo
        // incidentally, the echo contains the string sent, including the CR but not the LF, 
        // followed by a second CRLF pair, eg if you send
        // AT+RST[CR][LF] the first response back is
        // AT+RST[CR][CR][LF]
        // the [CR] you send actually seems to form part of the command (if no CR is sent, 
        // the command is not successful, if no LF is sent, the command is not even attempted      
        if((bytesRead = this->espSerial->readBytesUntil('\n',statusBuffer,sizeof(statusBuffer)-1)))
        {        
          ESP82336_DEBUG(statusBuffer);
          
          // readBytesUntil does NOT include the terminator, conveniently as we are getting
          // CRLF termination, we can check for the CR instead.
          if(statusBuffer[bytesRead-1] == '\r')
          {       
            ESP82336_DEBUG('\n');
            responseLineNum = 1;                    
          }
        }      
      }
      else
      {      
        // Fill status buffer
        if((bytesRead = this->espSerial->readBytesUntil('\n',statusBuffer,sizeof(statusBuffer)-1)))
        {
          ESP82336_DEBUG(statusBuffer);
          if(statusBuffer[bytesRead-1] == '\r')
          {
            ESP82336_DEBUG('\n');
          }
          
          if(strncmp_P(statusBuffer, PSTR("SEND OK"),  7) == 0) return ESP8266_OK;
          if(strncmp_P(statusBuffer, PSTR("OK"),       2) == 0) return ESP8266_OK;
          
          if(strncmp_P(statusBuffer, PSTR(">"),        1) == 0) return ESP8266_OK;
          if(strncmp_P(statusBuffer, PSTR("ERROR"),    5) == 0) return ESP8266_ERROR;                                
          if(strncmp_P(statusBuffer, PSTR("nochange"), 8) == 0) return ESP8266_OK;         
          if(strncmp_P(statusBuffer, PSTR("no change"),9) == 0) return ESP8266_OK;         
          if(strncmp_P(statusBuffer, PSTR("ready"),    5) == 0) return ESP8266_READY;            
          if(strncmp_P(statusBuffer, PSTR("busy"),     4) == 0) return ESP8266_BUSY;    
          if(strncmp_P(statusBuffer, PSTR("Unlink"),   6) == 0) return ESP8266_OK;
          if(strncmp_P(statusBuffer, PSTR("Link is builded"), 15) == 0) return ESP8266_OK;
          
          // If we are using a response buffer, and we have reached the start line
          // requested (defaults to line 1)        
          if(responseBufferLength && ( getResponseFromLine <= responseLineNum))
          {      
            // If there is room in the response buffer less one byte, copy the statusbuffer there
            if(responseBufferIndex < responseBufferLength-1)
            {
              memcpy(responseBuffer+responseBufferIndex, statusBuffer, min(bytesRead, responseBufferLength-1-responseBufferIndex));
              responseBufferIndex += min(bytesRead, responseBufferLength-1-responseBufferIndex);
              
              if(statusBuffer[bytesRead-1] == '\r')
              {
                if(responseBufferIndex<responseBufferLength-1)
                {
                  responseBuffer[responseBufferIndex++]='\n';
                }
              }
            }         
          }               

          // readBytesUntil does NOT include the terminator, conveniently as we are getting
          // CRLF termination, we can check for the CR instead.
          if(statusBuffer[bytesRead-1] == '\r')
          {
            responseLineNum++;               
          }    
        }
      }
    }
    // At 9600bps, I think we should keep this below 100uS to be able to keep up with certainty
    delayMicroseconds(100);    
    waitingMicroSeconds += 100;    
  }
  while(waitingMicroSeconds < this->generalCommandTimeoutMicroseconds);    
  
  ESP82336_DEBUGLN("TIMED OUT");
  
  // If we got here, we never say an OK or ERROR in the time allowed
  return ESP8266_TIMEOUT;
}

// Blindly send command
byte ESP8266_Simple::sendCommand(const char *cmd)
{
  // Pass off to the normal send command just without a response buffer
  return this->sendCommand(cmd, NULL, 0);
}

byte ESP8266_Simple::sendCommand(const __FlashStringHelper *cmd)
{
  char cmdBuffer[strlen_P((const char *)cmd)+1];
  strcpy_P(cmdBuffer, (const char *) cmd); 
  
  return this->sendCommand(cmdBuffer, NULL, 0);  
}

void ESP8266_Simple::clearSerialBuffer()
{
  while(this->espSerial->available()) this->espSerial->read();  
  this->espSerial->overflow();
}

void ESP8266_Simple::getErrorMessage(byte responseCode, char *bufferWithMinLength50Char)
{
  memset(bufferWithMinLength50Char, 0, 50);
  switch(responseCode)
  {
    case ESP8266_ERROR:    strncpy_P(bufferWithMinLength50Char, PSTR("General Error"), 49); break;
    case ESP8266_TIMEOUT:  strncpy_P(bufferWithMinLength50Char, PSTR("Timeout Waiting For Response"), 49); break;
    case ESP8266_OVERFLOW: strncpy_P(bufferWithMinLength50Char, PSTR("Overflow In Serial Buffer"), 49); break;
    case ESP8266_BUSY:     strncpy_P(bufferWithMinLength50Char, PSTR("Device Is Busy"), 49); break;
    case ESP8266_READY:    strncpy_P(bufferWithMinLength50Char, PSTR("Device issued \"ready\" unexpectedly (rebooted)"), 49); break;
  }
}


void ESP8266_Simple::debugPrintError(byte responseCode, Print *debugPrinter)
{  
  if(!debugPrinter) return;
  
  char buffer[50];
  this->getErrorMessage(responseCode, buffer);
  debugPrinter->println(buffer);  
}
